Data/Data review 2/No.of Requests/Implemented topo/TXT/test_least_file.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   3.235 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10259000 bytes
HTML transferred:       10240000 bytes
Requests per second:    30.92 [#/sec] (mean)
Time per request:       323.463 [ms] (mean)
Time per request:       32.346 [ms] (mean, across all concurrent requests)
Transfer rate:          3097.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       40  261  83.0    261     455
Processing:     1   49  47.3     46     187
Waiting:        0   49  47.2     45     187
Total:         47  311  95.0    305     527

Percentage of the requests served within a certain time (ms)
  50%    305
  66%    345
  75%    373
  80%    382
  90%    421
  95%    499
  98%    527
  99%    527
 100%    527 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_500kb.txt
Document Length:        195 bytes

Concurrency Level:      10
Time taken for tests:   3.983 seconds
Complete requests:      200
Failed requests:        0
Non-2xx responses:      200
Total transferred:      69000 bytes
HTML transferred:       39000 bytes
Requests per second:    50.22 [#/sec] (mean)
Time per request:       199.126 [ms] (mean)
Time per request:       19.913 [ms] (mean, across all concurrent requests)
Transfer rate:          16.92 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       45  156  46.6    169     251
Processing:     0   35  42.9      4     165
Waiting:        0   32  40.3      4     165
Total:         50  191  60.6    184     381

Percentage of the requests served within a certain time (ms)
  50%    184
  66%    200
  75%    233
  80%    248
  90%    281
  95%    293
  98%    337
  99%    354
 100%    381 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)
Total of 150 requests completed
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)
Total of 299 requests completed