Data/Data review 2/No.of Requests/Implemented topo/TXT/test_rand_file.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   3.257 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10259000 bytes
HTML transferred:       10240000 bytes
Requests per second:    30.71 [#/sec] (mean)
Time per request:       325.670 [ms] (mean)
Time per request:       32.567 [ms] (mean, across all concurrent requests)
Transfer rate:          3076.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       29  265  82.0    271     449
Processing:     1   51  47.9     48     205
Waiting:        0   51  47.8     47     204
Total:         34  317  95.0    308     534

Percentage of the requests served within a certain time (ms)
  50%    308
  66%    367
  75%    379
  80%    396
  90%    440
  95%    499
  98%    522
  99%    534
 100%    534 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_500kb.txt
Document Length:        195 bytes

Concurrency Level:      10
Time taken for tests:   3.293 seconds
Complete requests:      200
Failed requests:        0
Non-2xx responses:      200
Total transferred:      69000 bytes
HTML transferred:       39000 bytes
Requests per second:    60.74 [#/sec] (mean)
Time per request:       164.649 [ms] (mean)
Time per request:       16.465 [ms] (mean, across all concurrent requests)
Transfer rate:          20.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       19  125  38.2    126     235
Processing:     0   31  37.1      7     147
Waiting:        0   30  35.4      6     147
Total:         62  156  44.1    148     302

Percentage of the requests served within a certain time (ms)
  50%    148
  66%    168
  75%    180
  80%    192
  90%    217
  95%    236
  98%    276
  99%    298
 100%    302 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)
Total of 144 requests completed
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100mb.txt
Document Length:        195 bytes

Concurrency Level:      10
Time taken for tests:   5.276 seconds
Complete requests:      300
Failed requests:        0
Non-2xx responses:      300
Total transferred:      103500 bytes
HTML transferred:       58500 bytes
Requests per second:    56.86 [#/sec] (mean)
Time per request:       175.882 [ms] (mean)
Time per request:       17.588 [ms] (mean, across all concurrent requests)
Transfer rate:          19.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       52  133  38.1    131     236
Processing:     0   38  39.9     35     179
Waiting:        0   36  38.3     35     179
Total:         69  171  53.2    164     293

Percentage of the requests served within a certain time (ms)
  50%    164
  66%    200
  75%    218
  80%    226
  90%    243
  95%    264
  98%    276
  99%    282
 100%    293 (longest request)